#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.apim.azurerm_api_management_diagnostic.azuremonitor[0] will be created
  + resource "azurerm_api_management_diagnostic" "azuremonitor" {
      + always_log_errors         = true
      + api_management_logger_id  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/loggers/azuremonitor"
      + api_management_name       = "dx-d-itn-playground-pg-apim-01"
      + http_correlation_protocol = (known after apply)
      + id                        = (known after apply)
      + identifier                = "azuremonitor"
      + log_client_ip             = (known after apply)
      + resource_group_name       = "dx-d-itn-test-rg-01"
      + sampling_percentage       = 100
      + verbosity                 = "information"

      + backend_request (known after apply)

      + backend_response (known after apply)

      + frontend_request (known after apply)

      + frontend_response (known after apply)
    }

  # module.apim.azurerm_monitor_diagnostic_setting.apim[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "apim" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.OperationalInsights/workspaces/dx-d-playground-log-01"
      + name                           = "dx-d-itn-playground-pg-apim-01-diagnostic"
      + target_resource_id             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01"

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category_group = "audit"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          + <policies>
          - 	<inbound>
          +   <inbound>
          - 		<base />
          +     <base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          + 
          - 		<choose>
          +      <!-- Append base-path, if defined, before invoking the backend -->
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          +     <choose>
          - 			<otherwise>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          +       </when>
          - 			</otherwise>
          +       <otherwise>
          - 		</choose>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          - 		<set-header name="x-functions-key" exists-action="override">
          +       </otherwise>
          - 			<value>{{to-do-api-function-key}}</value>
          +     </choose>
          - 		</set-header>
          + 
          - 		<cors>
          +     <cors>
          - 			<allowed-origins>
          +       <allowed-origins>
          - 				<origin>*</origin>
          +           <origin>*</origin>
          - 			</allowed-origins>
          +       </allowed-origins>
          - 			<allowed-methods>
          +       <allowed-methods>
          - 				<method>*</method>
          +           <method>*</method>
          - 			</allowed-methods>
          +       </allowed-methods>
          - 			<allowed-headers>
          +       <allowed-headers>
          - 				<header>*</header>
          +           <header>*</header>
          - 			</allowed-headers>
          +       </allowed-headers>
          - 			<expose-headers>
          +       <expose-headers>
          - 				<header>*</header>
          +           <header>*</header>
          - 			</expose-headers>
          +       </expose-headers>
          - 		</cors>
          +     </cors>
          - 	</inbound>
          +   </inbound>
          - 	<outbound>
          +   <outbound>
          - 		<base />
          +     <base />
          - 	</outbound>
          +   </outbound>
          - 	<backend>
          +   <backend>
          - 		<base />
          +     <base />
          - 	</backend>
          +   </backend>
          - 	<on-error>
          +   <on-error>
          - 		<base />
          +     <base />
          - 	</on-error>
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.to_do_api.azurerm_api_management_backend.backend will be updated in-place
  ~ resource "azurerm_api_management_backend" "backend" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/backends/to-do-api-azure-function"
        name                = "to-do-api-azure-function"
      + resource_id         = "https://management.azure.com/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-be-func-01"
        # (6 unchanged attributes hidden)

      + credentials {
          + header = {
              + "x-functions-key" = "{{to-do-api-function-key}}"
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
